Конфигурация/Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредопределенныйВариант</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/ВариантыОтчетов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДоступностьПриИзменении(Элемент)
	Объект.Общий = (ЭтаФорма.Доступен = 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Доступен = ?(Объект.Общий, 1, 0);
	Элементы.ГруппаПолныеПрава.Видимость = РольДоступна("ПолныеПрава");
	
	Если Не Параметры.ЗначениеКопирования.Пустая() Тогда
		ЭтаФорма.АдресНастроек = ПоместитьВоВременноеХранилище(Параметры.ЗначениеКопирования.Настройки, ЭтаФорма.УникальныйИдентификатор);
	ИначеЕсли Не Параметры.Ключ.Пустая() Тогда
		ЭтаФорма.АдресНастроек = ПоместитьВоВременноеХранилище(Параметры.Ключ.Настройки, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ПустаяСтрока(ЭтаФорма.АдресНастроек) Тогда
		ТекущийОбъект.Настройки = ПолучитьИзВременногоХранилища(ЭтаФорма.АдресНастроек);
	КонецЕсли;
	
КонецПроцедуры
